003_HVAC/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 293;
    }

    outlet
    {
        type            zeroGradient;
    }

    "(top|walls)"
    {
        type            fixedValue;
        value           uniform 288;
    }

    bottom
    {
        type            fixedValue;
        value           uniform 308;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
