003_HVAC/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          2;
        startFace       12640;
    }
    outlet
    {
        type            patch;
        nFaces          2;
        startFace       12642;
    }
    top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          80;
        startFace       12644;
    }
    bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          80;
        startFace       12724;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          156;
        startFace       12804;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          12800;
        startFace       12960;
    }
)

// ************************************************************************* //
